Rafa350/EOS/v2/Source/HTL/STM32/htlUART.cpp
		_state = State::transmiting;

		enableTransmission(_usart);

		while (length-- > 0) {
			if (!waitTransmissionBufferEmptyFlag(_usart, expireTime)) {
				error = true;
				break;
			}
			_usart->TDR = *buffer++;
		}

	    if (!waitTransmissionCompleteFlag(_usart, expireTime))
	    	error = true;

		disableTransmission(_usart);

		_state = State::ready;

		return error ? Results::timeout : Results::success;
	}

	else if ((_state == State::transmiting) || (_state == State::receiving))
		return Results::busy;

	else
		return Results::errorState;
}


/// ----------------------------------------------------------------------
/// \brief    Inicia la transmissio d'un bloc de dades per interrupcions.
/// \param    buffer: Buffer de dades.
/// \param    length: El nombre de bytes a transmetre.
/// \return   El resultat de l'operacio
///
#if HTL_UART_OPTION_IRQ == 1
eos::Result UARTDevice::transmit_IRQ(
	const uint8_t *buffer,
	unsigned length) {

	if (_state == State::ready) {

		_state = State::transmiting;

		_txBuffer = buffer;
		_txCount = 0;
        _txMaxCount = length;

        enableTransmissionIRQ(_usart);

		return Results::success;
	}

	else if ((_state == State::transmiting) || (_state == State::receiving))
		return Results::busy;

	else
		return Results::errorState;
}
#endif


/// ----------------------------------------------------------------------
/// \brief    Transmiteix un bloc de dades utilitzant DMA.
/// \param    devDMA: Dispositiu DMA.
/// \param    buffer: Buffer de dades.
/// \param    length: El nombre de bytes a transmetre.
/// \return   El resultat de l'operacio
///
#if HTL_UART_OPTION_DMA == 1
eos::Result UARTDevice::transmit_DMA(
    dma::DMADevice *devDMA,
    const uint8_t *buffer,
    unsigned length) {

    if (_state == State::ready) {

        _state = State::transmiting;

        _txBuffer = buffer;
        _txCount = 0;
        _txMaxCount = length;

        enableTransmissionDMA(_usart);

        // Inicia la transferencia per DMA
        //
        devDMA->setNotifyEvent(_dmaNotifyEvent, true);
        devDMA->start(buffer, (uint8_t*)&(_usart->TDR), _txMaxCount);

        return Results::success;
    }

    else if ((_state == State::transmiting) || (_state == State::receiving))
        return Results::busy;

    else
        return Results::errorState;
}
#endif


/// ----------------------------------------------------------------------
/// \brief    Aborta la transmissio.
///
eos::Result UARTDevice::abortTransmission() {

	if (_state == State::transmiting) {
		disableTransmission(_usart);
		_state = State::ready;
		return eos::Results::success;
	}
	else
		return Results::errorState;
}


/// ----------------------------------------------------------------------
/// \brief    Reb en bloc de dades.
/// \param    buffer: Buffer de recepcio de dades.
/// \param    bufferSize: Tamany del buffer en bytes.
/// \param    timeout: Temps maxim de bloqueig.
/// \return   El resultat.
///
eos::Result UARTDevice::receive(
	uint8_t *buffer,
	unsigned bufferSize,
	unsigned timeout) {

	if (_state == State::ready) {

		_state = State::receiving;

		auto expireTime = getTick() + timeout;
		bool error = false;

		enableReception(_usart);

		while (bufferSize-- > 0) {

			if (!waitReceptionBufferNotEmptyFlag(_usart, expireTime)) {
				error = true;
				break;
			}

			*buffer++ = _usart->RDR;
		}

		disableTransmission(_usart);

		_state = State::ready;

		return error ? Results::timeout : Results::success;
	}
	else if ((_state == State::transmiting) || (_state == State::receiving))
		return Results::busy;

	else
		return Results::errorState;
}


/// ----------------------------------------------------------------------
/// \brief    Inicia la recepcio d'un bloc de dades per interrupcions.
/// \param    buffer: Buffer de dades.
/// \param    bufferSize: Tamany del buffer en bytes.
/// \return   El resultat de l'operacio.
///
#if HTL_UART_OPTION_IRQ == 1
eos::Result UARTDevice::receive_IRQ(
	uint8_t *buffer,
	unsigned bufferSize) {

	if (_state == State::ready) {

		_state = State::receiving;

		_rxBuffer = buffer;
		_rxCount = 0;
		_rxMaxCount = bufferSize;

		enableReceptionIRQ(_usart);

		return Results::success;
	}

	else if ((_state == State::transmiting) || (_state == State::receiving))
		return Results::busy;

	else
		return Results::errorState;
}
#endif


/// ----------------------------------------------------------------------
/// \brief    Reb un bloc de dades utilitzan DMA.
/// \param    devDMA: El dispositiu DMA.
/// \param    buffer: El buffer de dades.
/// \param    bufferSize: El tamany del buffer en bytes.
/// \return   El resultat de l'operacio.
///
#if HTL_UART_OPTION_DMA == 1
eos::Result UARTDevice::receive_DMA(
    dma::DMADevice *devDMA,
    uint8_t *buffer,
    unsigned bufferSize) {

	return Results::error;
}
#endif


/// ----------------------------------------------------------------------
/// \brief    Aborta la recepcio.
///
eos::Result UARTDevice::abortReception() {

	if (_state == State::receiving) {
		disableReception(_usart);
		_state = State::ready;
		return eos::Results::success;
	}
	else
		return Results::errorState;
}


/// ----------------------------------------------------------------------
/// \brief    Procesa les interrupcions.
///
#if HTL_UART_OPTION_IRQ == 1
#if defined(EOS_PLATFORM_STM32F0)
void UARTDevice::interruptService() {

	auto CR1 = _usart->CR1;
	auto CR3 = _usart->CR3;
	auto ISR = _usart->ISR;

	// Comprova de forma rapida si hi ha errors
	//
	if (ISR & (USART_ISR_PE | USART_ISR_FE | USART_ISR_ORE | USART_ISR_NE)) {

		// Comprova si es un error PARITY
		//
		if ((ISR & USART_ISR_PE) && (CR1 & USART_CR1_PEIE)) {
			_usart->ICR = USART_ICR_PECF;
		}

		// Comprova si hi ha error FRAME
		//
	    if ((ISR & USART_ISR_FE) && (CR3 & USART_CR3_EIE)) {
	    	_usart->ICR = USART_ICR_FECF;
	    }

	    // Comprova si es un error NOISE
	    //
	    if ((ISR & USART_ISR_NE) && (CR3 & USART_CR3_EIE)) {
	    	_usart->ICR = USART_ICR_NCF;
	    }

		// Comprova si es un error OVERRUN
		//
		if ((ISR & USART_ISR_ORE) &&
			(CR1 & USART_CR1_RXNEIE) &&
			(CR3 & USART_CR3_EIE)) {
			_usart->ICR = USART_ICR_ORECF;
		}
	}

	// No hi han errrors
	//
	else {
		// Interrupcio 'TXE'
		//
		if ((CR1 & USART_CR1_TXEIE) && (ISR & USART_ISR_TXE)) {
			if (_txCount < _txMaxCount) {
				_usart->TDR = _txBuffer[_txCount++];
				if (_txCount == _txMaxCount) {
					auto a = startATOMIC();
					_usart->CR1 &= ~USART_CR1_TXEIE;   // Deshabilita interrupcio TXE
					_usart->CR1 |= USART_CR1_TCIE;     // Habilita interrupcio TC
					endATOMIC(a);
				}
			}
		}

		// Interrupcio 'TC'. Nomes en l'ultim caracter transmes.
		//
		if ((CR1 & USART_CR1_TCIE) && (ISR & USART_ISR_TC)) {
			_usart->ICR = USART_ICR_TCCF;
			disableTransmission(_usart);
			notifyTxCompleted(_txBuffer, _txCount, true);
			_state = State::ready;
		}

		/// Interrupcio 'RXNE'
		//
		if ((CR1 & USART_CR1_RXNEIE) && (ISR & USART_ISR_RXNE)) {
			if (_rxCount < _rxMaxCount) {
				_rxBuffer[_rxCount++] = _usart->RDR;
				if (_rxCount == _rxMaxCount) {
					disableReception(_usart);
					notifyRxCompleted(_rxBuffer, _rxCount, true);
					_state = State::ready;
				}
			}
		}

