Rafa350/EOS/v2/Source/HTL/STM32/htlUART.cpp
	usart->CR1 &= ~(
		#if defined(EOS_PLATFORM_STM32G0)
		USART_CR1_FIFOEN | // Deshabilita el FIFO
		#endif
		USART_CR1_UE |     // Desabilita el dispositiu
		USART_CR1_TE |     // Desabilita la transmissio
		USART_CR1_RE);     // Deshabilita la recepcio
}


/// ----------------------------------------------------------------------
/// \brief    Habilita la transmissio de dades.
/// \param    usart: Registres de hardware del dispositiu.
///
static void enableTransmission(
	USART_TypeDef *usart) {

	usart->ICR = USART_ICR_TCCF;   // Borra el flag TC

	auto a = startATOMIC();
	usart->CR1 |= USART_CR1_TE;    // Habilita la tramsmissio
	endATOMIC(a);
}


/// ----------------------------------------------------------------------
/// \brief    Habilita la transmissio de dades en modus IRQ
/// \param    usart: Registres de hardware del dispositiu.
///
#if HTL_UART_OPTION_IRQ == 1
static void enableTransmissionIRQ(
	USART_TypeDef *usart) {

	usart->ICR = USART_ICR_TCCF;   // Borra el flag TC

	auto a = startATOMIC();
	usart->CR1 |=
		#if defined(EOS_PLATFORM_STM32G0)
		USART_CR1_TXEIE_TXFNFIE | // Habilita interrupcio TXE
		#else
		USART_CR1_TXEIE |         // Habilita interrupcio TXE
		#endif
		USART_CR1_TE;             // Habilita la transmissio
	endATOMIC(a);
}
#endif


/// ----------------------------------------------------------------------
/// \brief    Habilita la transmissio de dades en modus DMA
/// \param    usart: Registres de hardware del dispositiu.
///
#if HTL_UART_OPTION_DMA == 1
static void enableTransmissionDMA(
	USART_TypeDef *usart) {

	usart->ICR = USART_ICR_TCCF;   // Borra el flag TC

	auto a = startATOMIC();
    usart->CR1 |= USART_CR1_TE;    // Habilita transmissio
    usart->CR3 |= USART_CR3_DMAT;  // Habilita DMA
    endATOMIC(a);
}
#endif


/// ----------------------------------------------------------------------
/// \brief    Deshabilita la transmissio
/// \param    usart: Registres de hardware del dispositiu.
///
static void disableTransmission(
	USART_TypeDef *usart) {

	auto a = startATOMIC();

	// Desabilita interrupcions i transmissio
	//
	usart->CR1 &= ~(
#if defined(EOS_PLATFORM_STM32F0)
		USART_CR1_TXEIE |         // Deshabilita interrupcio TXE
#else
		USART_CR1_TXEIE_TXFNFIE | // Deshabilita interrupcio TXE
#endif
		USART_CR1_TCIE |          // Deshabilita interrupcio TC
		USART_CR1_TE);            // Desabilita transmissio

	// Deshabilita el DMA
	//
	usart->CR3 &= ~USART_CR3_DMAT;

	endATOMIC(a);
}


/// ----------------------------------------------------------------------
/// \brief    Habilita la recepcio.
/// \param    usart: Registres de hardware del dispoositiu.
///
static void enableReception(
	USART_TypeDef *usart) {

	usart->ICR = USART_ICR_RTOCF; // Borra el flag RTO

	auto a = startATOMIC();
	usart->CR1 |= USART_CR1_RE;
	endATOMIC(a);
}


/// ----------------------------------------------------------------------
/// \brief    Habilita la recepcio en modus IRQ.
/// \param    usart: Registres de hardware del dispoositiu.
///
#if HTL_UART_OPTION_IRQ == 1
static void enableReceptionIRQ(
	USART_TypeDef *usart) {

	usart->ICR =
		USART_ICR_RTOCF |           // Borra el flag RTO
		USART_ICR_IDLECF;           // Borra el flag IDLE

	auto a = startATOMIC();
	usart->CR1 |=
		USART_CR1_PEIE |            // Habilita interrupcio PE
		#if defined(EOS_PLATFORM_STM32G0)
		USART_CR1_RXNEIE_RXFNEIE |  // Habilita interrupcio RXNE
		#else
		USART_CR1_RXNEIE |          // Habilita interrupcio RXNE
		#endif
		USART_CR1_RE;               // Habilita la recepcio

	// Activa RTO si es posible, si no, activa IDLE
	// Notes:  Si RTO no esta suportat RTOEN sempre estara a zero per hardware
	//
	if (usart->CR2 & USART_CR2_RTOEN)
		usart->CR1 |= USART_CR1_RTOIE;   // Habilita interrupcio RTO
	else
		usart->CR1 |= USART_CR1_IDLEIE;  // Habilita interrupcio IDLE

	endATOMIC(a);
}
#endif


/// ----------------------------------------------------------------------
/// \brief    Deshabilita la recepcio.
/// \param    usart: Registres de hardware del dispositiu.
///
static void disableReception(
	USART_TypeDef *usart) {

	auto a = startATOMIC();

	// Desabilita interrupcions i recepcio
	//
	usart->CR1 &= ~(
#if defined(EOS_PLATFORM_STM32F0)
		USART_CR1_RXNEIE |         // Deshabilita interrupcio RXNE
#else
		USART_CR1_RXNEIE_RXFNEIE | // Deshabilita interrupcio RXNE
#endif
		USART_CR1_RTOIE |          // Deshabilita interrupcio RTO
		USART_CR1_IDLEIE |         // Deshabilita interrupcio IDLE
		USART_CR1_PEIE |           // Deshabilita interrupcio PE
		USART_CR1_RE);             // Deshabilita recepcio

	// Deshabilita el DMA
	//
	usart->CR3 &= ~USART_CR3_DMAT;

	endATOMIC(a);
}
